apply_library_patches: true
bundled_packages_dir: packages
data_dir: data
description: null
environment_variables: {}
examples_filename: examples.yaml
external_package_dirs: []
input_type: Any
live_reload: false
model_class_filename: model.py
model_class_name: Model
model_framework: mlflow
model_metadata:
  model_binary_dir: model
  supports_predict_proba: false
model_module_dir: model
model_name: null
model_type: Model
python_version: py310
requirements:
- mlflow==2.7.1
- cloudpickle==2.2.1
- numpy==1.23.5
- packaging==20.9
- psutil==5.9.6
- pyyaml==6.0.1
- scikit-learn==1.3.1
- scipy==1.11.3
resources:
  accelerator: null
  cpu: 500m
  memory: 512Mi
  use_gpu: false
secrets: {}
spec_version: '2.0'
system_packages: []
train:
  resources:
    accelerator: null
    cpu: 500m
    memory: 512Mi
    use_gpu: false
  training_class_filename: train.py
  training_class_name: Train
  training_module_dir: train
  variables: {}
